PERSONAL_STATISTICS = ("<b>Ваши poky-ball'ы:</b>\n"
                      "{poky_balls}\n"
                      "\n"
                      "📊<b>Ваша статистика:</b>\n"
                      "\n"
                      "Последняя after-daily партия: {last_daily_game_date}\n"
                      "After-daily партий выиграно: {daily_wins} из {daily_total}\n"
                      "Дуэлей выиграно: {couple_tourney_won} из {couple_tourney_total}\n"
                      "Дуэльных партий выиграно: {couple_tourney_games_won} из {couple_tourney_games_total}")
NO_POKIES_TO_SET_AS_TITLE = ("Не из чего устанавливать - у Вас нет poky-ball'ов 😿\n"
                             "Poky-ball'ы можно получать в качестве трофеев за победы в дуэлях")
CHOOSE_TITLE_POKY = ("Выберите poky-ball, который хотите сделать титульным\n"
                     "(он будет отображаться рядом с Вашим именем)")
TITLE_POKY_SET = "{emoji} теперь является Вашим титульным poky-ball'ом"
